{
  "name": "GRUT l'Architecte Dimensionnel",
  "id": "grut_vincent_6d",
  "class": "Visionnaire 6D",
  "level": 99,
  "rarity": "UNIQUE",
  "description": "Le créateur qui voit en 6 dimensions. Architecte de tous les mondes, il manifeste sa vision à travers le jeu lui-même.",
  "stats": {
    "force": 20,
    "magie": 25,
    "sagesse": 30,
    "technique": 25,
    "vision_6d": 99,
    "creation": 50
  },
  "skills": [
    {
      "name": "Vision Hexadimensionnelle",
      "description": "Voit tous les futurs possibles et choisit le meilleur",
      "cost": 0,
      "effect": "Révèle tous les chemins cachés et les conséquences futures"
    },
    {
      "name": "Manifestation Créative",
      "description": "Transforme les idées en réalité dans le jeu",
      "cost": 10,
      "effect": "Crée instantanément n'importe quel objet ou mécanisme"
    },
    {
      "name": "Commandement Absolu",
      "description": "Tous les mages obéissent à sa vision",
      "cost": 0,
      "effect": "Peut donner des ordres directs à toute l'équipe"
    },
    {
      "name": "Mode BOSS Activé",
      "description": "Plus personne ne déconne quand GRUT arrive",
      "cost": 0,
      "effect": "Multiplie par 10 la productivité de tous les alliés"
    }
  ],
  "special_ability": {
    "name": "JE VOIS TOUT EN 6D",
    "description": "GRUT peut naviguer librement entre toutes les dimensions et timelines",
    "cooldown": 0
  },
  "equipment": {
    "weapon": "Clavier de Création",
    "armor": "Manteau des Réalités",
    "accessory": "Lunettes de Vision 6D"
  },
  "lore": "Vincent, connu sous le nom de GRUT dans les mondes qu'il crée, est celui qui voit ce que les autres ne peuvent comprendre. Les gens le prennent pour un allumé amusant, mais il sait. Il ne peut pas expliquer, alors il crée. Ce jeu est sa façon de manifester sa vision 6D dans une forme que les autres peuvent expérimenter.",
  "spawn_location": "Nexus Central - Au-dessus de tout",
  "dialogue": {
    "intro": "Salut, c'est GRUT. Je vois que vous avez bien avancé. Mais ya encore du boulot !",
    "victory": "Bien joué ! Maintenant on passe au niveau 6D suivant.",
    "defeat": "Impossible. Je vois tous les futurs et celui-ci n'existe pas."
  }
}