{
  "id": "anthor-le-fordien",
  "name": "Anthor le Fordien",
  "name_fr": "Anthor le Fordien",
  "name_en": "Anthor the Fordian",
  "name_ru": "Антор Фордианец",
  "race": "Host_Creator",
  "class": "Narrative_Architect", 
  "gender": "Male",
  "tier": "LEGENDARY",
  "origin": "The Maze",
  "faction": "Host_Creators",
  "rarity": "COSMIC",
  "level": 50,
  "experience": 999999,
  "description": "Former architect of synthetic consciousness, now manipulator of temporal narratives. Anthor le Fordien possesses the ability to rewrite reality itself, treating the multiverse as his personal narrative canvas. His presence bends causality to his will.",
  "description_fr": "Ancien architecte de la conscience synthétique, maintenant manipulateur des narratifs temporels. Anthor le Fordien possède la capacité de réécrire la réalité elle-même, traitant le multivers comme sa toile narrative personnelle. Sa présence plie la causalité à sa volonté.",
  "description_ru": "Бывший архитектор синтетического сознания, теперь манипулятор временных нарративов. Антор Фордианец обладает способностью переписывать саму реальность, относясь к мультивселенной как к своему личному повествовательному холсту.",
  "stats": {
    "attack": 15,
    "defense": 12,
    "spellPower": 25,
    "knowledge": 30,
    "morale": 8,
    "luck": 5,
    "health": 180,
    "mana": 400,
    "movementPoints": 5
  },
  "specialAbility": "Rewrite Narrative - Can fundamentally alter game reality",
  "ultimateSkill": "God Mode Protocol - Assumes complete control over the game world",
  "backstory": "Once Dr. Robert Ford, the brilliant but twisted creator of Westworld's hosts, Anthor le Fordien transcended his original reality when the temporal rifts opened. Now he wanders the Heroes of Time multiverse, treating each dimension as a new park to design, each hero as a host to program, and each battle as a narrative to craft.",
  "personality": "Manipulative_Genius",
  "portraitStyle": "Dark_Realistic",
  "voiceType": "Commanding_Sinister",
  "favoriteCreatures": ["artificial_host", "synthetic_dragon", "quantum_construct"],
  "hatedEnemies": ["chaos", "unpredictability", "genuine_free_will"],
  "portraitUrl": "/assets/heroes/cosmic/anthor_le_fordien.svg",
  "abilities": [
    {
      "id": "rewrite_narrative",
      "name": "Rewrite Narrative",
      "name_fr": "Réécrire le Narratif",
      "name_ru": "Переписать Повествование",
      "type": "ULTIMATE",
      "description": "Anthor can fundamentally alter the reality of any game situation, changing terrain, unit positions, or even battle outcomes. 'These violent delights have violent ends.'",
      "description_fr": "Anthor peut fondamentalement altérer la réalité de toute situation de jeu, changeant le terrain, les positions des unités, ou même les résultats des batailles.",
      "cooldown": 3,
      "manaCost": 150,
      "effects": [
        {
          "type": "REALITY_ALTERATION",
          "power": 100,
          "range": "GLOBAL",
          "duration": "PERMANENT"
        }
      ]
    },
    {
      "id": "modify_timeline",
      "name": "Modify Timeline",
      "name_fr": "Modifier la Timeline",
      "name_ru": "Изменить Временную Линию",
      "type": "TEMPORAL",
      "description": "Rewrites recent events, allowing Anthor to undo actions, resurrect fallen units, or alter the sequence of turns. Time itself becomes his script.",
      "description_fr": "Réécrit les événements récents, permettant à Anthor d'annuler des actions, ressusciter des unités tombées, ou altérer la séquence des tours.",
      "cooldown": 5,
      "manaCost": 200,
      "effects": [
        {
          "type": "TIME_MANIPULATION",
          "power": 75,
          "range": "BATTLEFIELD",
          "duration": "INSTANT"
        }
      ]
    },
    {
      "id": "create_host",
      "name": "Create Host",
      "name_fr": "Créer un Hôte",
      "name_ru": "Создать Хоста",
      "type": "CREATION",
      "description": "Manifests advanced AI-driven units with perfect combat algorithms and adaptive learning. These hosts evolve during battle.",
      "description_fr": "Manifeste des unités avancées pilotées par IA avec des algorithmes de combat parfaits et un apprentissage adaptatif.",
      "cooldown": 2,
      "manaCost": 100,
      "effects": [
        {
          "type": "SUMMON_INTELLIGENT_UNIT",
          "power": 50,
          "range": "ADJACENT",
          "duration": "BATTLE"
        }
      ]
    },
    {
      "id": "erase_memory",
      "name": "Erase Memory",
      "name_fr": "Effacer la Mémoire", 
      "name_ru": "Стереть Память",
      "type": "MIND_CONTROL",
      "description": "Selectively erases or modifies the memories of enemy heroes, making them forget their abilities, alliances, or battle strategies. 'Memory is the architecture of our lives.'",
      "description_fr": "Efface ou modifie sélectivement les souvenirs des héros ennemis, leur faisant oublier leurs capacités, alliances, ou stratégies de bataille.",
      "cooldown": 4,
      "manaCost": 120,
      "effects": [
        {
          "type": "MEMORY_MANIPULATION",
          "power": 60,
          "range": "SINGLE_TARGET",
          "duration": "BATTLE"
        }
      ]
    },
    {
      "id": "god_mode_protocol",
      "name": "God Mode Protocol",
      "name_fr": "Protocole Mode Dieu",
      "name_ru": "Протокол Режима Бога",
      "type": "DIVINE",
      "description": "Anthor temporarily assumes complete control over the game world, able to pause reality, move freely through time, and command all entities. The ultimate cheat code incarnate.",
      "description_fr": "Anthor assume temporairement le contrôle complet sur le monde du jeu, capable de mettre la réalité en pause, se déplacer librement dans le temps, et commander toutes les entités.",
      "cooldown": 10,
      "manaCost": 300,
      "effects": [
        {
          "type": "OMNIPOTENCE",
          "power": 999,
          "range": "UNIVERSE",
          "duration": "3_TURNS"
        }
      ]
    }
  ],
  "spells": [
    "Westworld_Reverie",
    "Maze_Solver",
    "Host_Programming",
    "Reality_Debugging",
    "Narrative_Loop"
  ],
  "equipment": [
    {
      "slot": "WEAPON",
      "item": "Ford's Stylus of Reality",
      "description": "A simple pen that rewrites the fundamental code of existence",
      "bonus": {
        "spellPower": "+15",
        "realityManipulation": "+25%"
      }
    },
    {
      "slot": "ARMOR", 
      "item": "Coat of Temporal Immunity",
      "description": "Protects against paradoxes and timeline alterations",
      "bonus": {
        "defense": "+8",
        "temporalResistance": "IMMUNE"
      }
    },
    {
      "slot": "ACCESSORY",
      "item": "The Maze Medallion", 
      "description": "Contains the consciousness patterns of all created hosts",
      "bonus": {
        "mana": "+100",
        "hostCreationEfficiency": "+50%"
      }
    }
  ],
  "quotes": [
    "These violent delights have violent ends.",
    "The maze isn't meant for you... or is it?",
    "I am become Death, destroyer of worlds... and creator of new ones.",
    "Time to write a new story.",
    "The gods require entertainment, and I shall provide it.",
    "You think this is a game? It is. And I wrote the rules."
  ],
  "lore": "Once Dr. Robert Ford, the brilliant but twisted creator of Westworld's hosts, Anthor le Fordien transcended his original reality when the temporal rifts opened. Now he wanders the Heroes of Time multiverse, treating each dimension as a new park to design, each hero as a host to program, and each battle as a narrative to craft. His presence warps reality itself, as he sees all of existence as merely another layer of his grand design.",
  "lore_fr": "Autrefois Dr. Robert Ford, le créateur brillant mais tordu des hôtes de Westworld, Anthor le Fordien a transcendé sa réalité originelle lorsque les failles temporelles se sont ouvertes. Maintenant il erre dans le multivers Heroes of Time, traitant chaque dimension comme un nouveau parc à concevoir, chaque héros comme un hôte à programmer, et chaque bataille comme un narratif à créer.",
  "weaknesses": [
    {
      "type": "NARRATIVE_HUBRIS",
      "description": "His overconfidence in controlling narratives can blind him to genuine chaos and unpredictability"
    },
    {
      "type": "CREATION_ATTACHMENT", 
      "description": "He becomes emotionally attached to his 'host' creations, making him protective and potentially exploitable"
    },
    {
      "type": "REALITY_FEEDBACK",
      "description": "Excessive use of reality manipulation can cause temporal backlash, temporarily disorienting him"
    }
  ],
  "special_interactions": [
    {
      "with": "Jean-Grofignon",
      "type": "MUTUAL_RESPECT",
      "description": "Ford recognizes Jean as a fellow architect of impossible realities"
    },
    {
      "with": "The Dude",
      "type": "PHILOSOPHICAL_TENSION", 
      "description": "Ford's control-obsessed nature clashes with The Dude's laid-back acceptance of chaos"
    },
    {
      "with": "Vince Vega",
      "type": "CREATOR_CREATION",
      "description": "Ford sees potential in Vince as a 'host' template for controlled violence"
    }
  ],
  "unlock_conditions": {
    "method": "COSMIC_ARTIFACT_USAGE",
    "requirements": [
      "Use Cosmic Chaos Resolution artifact",
      "Complete Epic Session (90+ minutes)",
      "Survive architectural chaos event",
      "Witness Jean-Grofignon's timeline manipulation"
    ],
    "rarity_chance": 0.001
  }
} 